#Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
#в прописные.

s = "АдОльф лЮбит ябЛоЧки aNd baNanAs"
s_upper = s.upper()
print(s_upper)
