# даны 3 переменные вещественного типа А , B , C. Если их значения упорядочены по возрастанию, то удовить их;
# в противном случае заменить значения каждой переменной на противоположное. Вывести значения новых переменных A, B , C.
while True:
    try:
        a = float(input("Введите вещественное число1: "))
        b = float(input("Введите вещественное число2: "))
        c = float(input("Введите вещественное число3: "))
    except ValueError:
        print("Введите вещественное число!")
        continue
    break

if a < b < c:
    a *= 2
    b *= 2
    c *= 2
else:
    a = -a
    b = -b
    c = -c

print(f"Новые значения перменных а={a}, b ={b}, c={c}")